c5/src/ChartsOfCharacteristicTypes/Properties/Properties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>Properties</name>
  <type>
    <types>CatalogRef.Units</types>
    <types>CatalogRef.PaymentOptions</types>
    <types>CatalogRef.Organizations</types>
    <types>CatalogRef.FixedAssets</types>
    <types>CatalogRef.Expenses</types>
    <types>CatalogRef.Currencies</types>
    <types>CatalogRef.Warehouses</types>
    <types>CatalogRef.Countries</types>
    <types>CatalogRef.PropertyValues</types>
    <types>CatalogRef.Employees</types>
    <types>Boolean</types>
    <types>CatalogRef.PaymentLocations</types>
    <types>CatalogRef.Departments</types>
    <types>CatalogRef.Items</types>
    <types>CatalogRef.Companies</types>
    <types>CatalogRef.Users</types>
    <types>CatalogRef.Banks</types>
    <types>String</types>
    <types>CatalogRef.Cities</types>
    <types>CatalogRef.IntangibleAssets</types>
    <types>Date</types>
    <types>CatalogRef.Projects</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>150</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Class</name>
    <type>
      <types>EnumRef.PropertiesClass</types>
    </type>
  </attributes>
  <attributes>
    <name>ClearButton</name>
    <type>
      <types>EnumRef.YesNoAuto</types>
    </type>
  </attributes>
  <attributes>
    <name>Common</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Control</name>
    <type>
      <types>EnumRef.Controls</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultValue</name>
    <type>
      <types>Characteristic.Properties</types>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Properties</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupAppearance</name>
    <type>
      <types>EnumRef.GroupAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupType</name>
    <type>
      <types>EnumRef.Groups</types>
    </type>
  </attributes>
  <attributes>
    <name>HorizontalStretch</name>
    <type>
      <types>EnumRef.YesNoAuto</types>
    </type>
  </attributes>
  <attributes>
    <name>Host</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Properties</types>
    </type>
  </attributes>
  <attributes>
    <name>InDescription</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InName</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LabelDescription</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LabelName</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Mandatory</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Maximum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Minimum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Owner</name>
    <type>
      <types>DefinedType.ObjectsProperties</types>
    </type>
  </attributes>
  <attributes>
    <name>Position</name>
    <type>
      <types>DefinedType.PropertyPosition</types>
    </type>
  </attributes>
  <attributes>
    <name>Scope</name>
    <type>
      <types>EnumRef.PropertiesScope</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowTitle</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ToolTip</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

c5/src/InformationRegisters/CommonProperties/CommonProperties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CommonProperties</name>
  <resources>
    <name>DefaultValue</name>
    <type>
      <types>Characteristic.Properties</types>
    </type>
  </resources>
  <resources>
    <name>Folder</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Properties</types>
    </type>
  </resources>
  <resources>
    <name>Host</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Properties</types>
    </type>
  </resources>
  <resources>
    <name>Mandatory</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Position</name>
    <type>
      <types>DefinedType.PropertyPosition</types>
    </type>
  </resources>
  <dimensions>
    <name>Property</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Properties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Owner</name>
    <type>
      <types>DefinedType.ObjectsProperties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Scope</name>
    <type>
      <types>EnumRef.PropertiesScope</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/ChartsOfCharacteristicTypes/Properties/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )

	StandardProcessing = false;
	Fields.Add ( "Description" );
	Fields.Add ( "Owner" );

EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	StandardProcessing = false;
	owner = Data.Owner;
	if ( owner = undefined ) then
		Presentation = Data.Description;
	else
		Presentation = Data.Description + " (" + owner + ")";
	endif;
	
EndProcedure

#endif

Procedure ChoiceDataGetProcessing ( ChoiceData, Parameters, StandardProcessing )

	filter = Parameters.Filter;
	if ( filterByOwner ( filter ) ) then
		replaceToReferences ( filter );
	endif;

EndProcedure

Function filterByOwner ( Filter )
	
	return Filter.Property ( "Owner" )
	and Filter.Property ( "Scope" );
	
EndFunction

Procedure replaceToReferences ( Filter )
	
	Filter.Insert ( "Ref", getProperties ( Filter ) );
	Filter.Delete ( "Scope" );
	Filter.Delete ( "Owner" );
	
EndProcedure

Function getProperties ( Filter )
	
	s = "
	|select Properties.Ref as Ref
	|from ChartOfCharacteristicTypes.Properties as Properties
	|where not Properties.DeletionMark
	|and not Properties.IsFolder
	|and Properties.Owner = &Owner
	|and Properties.Scope = &Scope
	|union all
	|select Properties.Property
	|from InformationRegister.CommonProperties as Properties
	|where Properties.Owner = &Owner
	|and Properties.Scope = &Scope
	|and not Properties.Property.DeletionMark
	|";
	q = new Query ( s );
	q.SetParameter ( "Owner", Filter.Owner );
	q.SetParameter ( "Scope", Filter.Scope );
	return q.Execute ().Unload ().UnloadColumn ( "Ref" );
	
EndFunction
